branches/salepoint/app/controllers/branch_controller.rb

  def branch
    @branches = Branch.all
---
SELECT * FROM "branches"