branches/salepoint/app/controllers/login_controller.rb

  def login
   @current_user = User.find_by_userid( params[:login] )
---
SELECT * FROM "users" WHERE ("users"."userid" = 'abc123') LIMIT 1