branches/salepoint/app/controllers/transaction_controller.rb

  def transaction
    @transactions = Transaction.all
---
SELECT * FROM "transactions"