app/controllers/manager_controller.rb

  def index
	@curr_user = User.find_by_id(session[:u_id])
---
SELECT * FROM "users" WHERE ("users"."userid" = '123abc') LIMIT 1