app/controllers/product_controller.rb

  def product
    @products = Product.all
---
SELECT * FROM "products"

  def add
    @product = Product.new(params[:product])

    if @product.save
---
INSERT INTO "products" ("updated_at", "option", "unit_price", "product_name", "created_at") VALUES('2009-03-25 05:21:56', NULL, NULL, NULL, '2009-03-25 05:21:56')

  def destroy
    @product = Product.find_by_product_name(params[:product])
---
SELECT * FROM "products" WHERE ("products"."product_name" IS NULL) LIMIT 1